podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/FLEXIO_S32K14x.svd.xml
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>SHIFTCFG%s</name>
               <description>Shifter Configuration N Register</description>
               <addressOffset>0x100</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>SSTART</name>
                     <description>Shifter Start bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Start bit disabled for transmitter/receiver/match store, transmitter loads data on enable</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Start bit disabled for transmitter/receiver/match store, transmitter loads data on first shift</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Transmitter outputs start bit value 0 before loading data on first shift, receiver/match store sets error flag if start bit is not 0</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Transmitter outputs start bit value 1 before loading data on first shift, receiver/match store sets error flag if start bit is not 1</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SSTOP</name>
                     <description>Shifter Stop bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Stop bit disabled for transmitter/receiver/match store</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reserved for transmitter/receiver/match store</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Transmitter outputs stop bit value 0 on store, receiver/match store sets error flag if stop bit is not 0</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Transmitter outputs stop bit value 1 on store, receiver/match store sets error flag if stop bit is not 1</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INSRC</name>
                     <description>Input Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Pin</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Shifter N+1 Output</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>SHIFTBUF%s</name>
               <description>Shifter Buffer N Register</description>
               <addressOffset>0x200</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>SHIFTBUF</name>
                     <description>Shift Buffer</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>SHIFTBUFBIS%s</name>
               <description>Shifter Buffer N Bit Swapped Register</description>
               <addressOffset>0x280</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>SHIFTBUFBIS</name>
                     <description>Shift Buffer</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>SHIFTBUFBYS%s</name>
               <description>Shifter Buffer N Byte Swapped Register</description>
               <addressOffset>0x300</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>SHIFTBUFBYS</name>
                     <description>Shift Buffer</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>SHIFTBUFBBS%s</name>
               <description>Shifter Buffer N Bit Byte Swapped Register</description>
               <addressOffset>0x380</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>SHIFTBUFBBS</name>
                     <description>Shift Buffer</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>TIMCTL%s</name>
               <description>Timer Control N Register</description>
               <addressOffset>0x400</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>TIMOD</name>
                     <description>Timer Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Timer Disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Dual 8-bit counters baud/bit mode</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Dual 8-bit counters PWM mode</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Single 16-bit counter mode</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PINPOL</name>
                     <description>Timer Pin Polarity</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Pin is active high</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Pin is active low</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PINSEL</name>
                     <description>Timer Pin Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>PINCFG</name>
                     <description>Timer Pin Configuration</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Timer pin output disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Timer pin open drain or bidirectional output enable</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Timer pin bidirectional output data</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Timer pin output</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRGSRC</name>
                     <description>Trigger Source</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>External trigger selected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Internal trigger selected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRGPOL</name>
                     <description>Trigger Polarity</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Trigger active high</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Trigger active low</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRGSEL</name>
                     <description>Trigger Select</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
